{
  "en": {
    "projectName": "Application Intelligence",
    "summary": "Micro-service focused on forecasting an observability tool usage.",
    "companyName": "DELL",
    "industry": "Technology",
    "description": "Project developed in partnership between DELL and the Distributed Systems Laboratory (LSD) at Universidade Federal de Campina Grande, focused on analyzing and forecasting the usage of observability tools (such as Splunk) in distributed environments. The goal was to accurately predict data consumption (in GB) over different time windows, supporting cost planning and resource optimization.",
    "roleTitle": "Data Science Lead",
    "roleDescription": "Led the data science efforts, including researching, implementing, and validating predictive models for time series forecasting. Also contributed to designing the overall architecture of the prediction service, ensuring smooth integration with orchestration and monitoring tools in a production environment.",
    "images": [
      "time_series_forecast_splunk.png",
      "time_series_graph.png",
      "mlflow_airflow_pipeline.png"
    ],
    "additionalRoles": [
      {
        "title": "Machine Learning Engineer",
        "text": "Designed and implemented end-to-end modeling pipelines integrated with MLflow for model tracking, versioning, and comparison. Automated model selection based on performance metrics."
      },
      {
        "title": "Backend Developer",
        "text": "Planned and developed the backend architecture of the forecasting service, integrating APIs with databases and orchestration systems (Airflow). The system was deployed in a Kubernetes environment using scheduled pods for periodic predictions."
      },
      {
        "title": "Time Series Researcher",
        "text": "Researched, implemented, and evaluated multiple forecasting approaches, including ARIMA, SARIMA, Prophet, exponential smoothing, and recurrent neural networks (RNNs), to ensure accuracy and robustness."
      }
    ]
  },
  "pt": {
    "projectName": "Application Intelligence",
    "summary": "Microsserviço focado na previsão de uso de uma ferramenta de observabilidade.",
    "companyName": "DELL",
    "industry": "Tecnologia",
    "description": "Projeto desenvolvido em parceria entre a DELL e o Laboratório de Sistemas Distribuídos (LSD) da Universidade Federal de Campina Grande, com foco na análise e previsão de uso de ferramentas de observabilidade (como o Splunk) em ambientes distribuídos. O objetivo era prever com precisão o consumo de dados (em GB) em diferentes janelas de tempo, apoiando o planejamento de custos e a otimização de recursos.",
    "roleTitle": "Líder de Ciência de Dados",
    "roleDescription": "Liderei os esforços em ciência de dados, incluindo pesquisa, implementação e validação de modelos preditivos para séries temporais. Também contribuí para o design da arquitetura geral do serviço de previsão, garantindo integração fluida com ferramentas de orquestração e monitoramento em produção.",
    "images": [
      "time_series_forecast_splunk.png",
      "time_series_graph.png",
      "mlflow_airflow_pipeline.png"
    ],
    "additionalRoles": [
      {
        "title": "Engenheiro de Machine Learning",
        "text": "Desenhei e implementei pipelines completos de modelagem integrados ao MLflow para rastreamento, versionamento e comparação de modelos. Automatizei a seleção de modelos com base em métricas de desempenho."
      },
      {
        "title": "Desenvolvedor Backend",
        "text": "Planejei e desenvolvi a arquitetura backend do serviço de previsão, integrando APIs com bancos de dados e sistemas de orquestração (Airflow). O sistema foi implantado em ambiente Kubernetes com pods agendados para previsões periódicas."
      },
      {
        "title": "Pesquisador em Séries Temporais",
        "text": "Pesquisei, implementei e avaliei diversas abordagens de previsão, incluindo ARIMA, SARIMA, Prophet, suavização exponencial e redes neurais recorrentes (RNNs), visando precisão e robustez."
      }
    ]
  }
}
